package by.academy.lesson4;

public class Arr2 {
	public static void main (String [] args) {
	
	//0. Создать массив типа String с размером 7. 
	//Записать в него значения дней недели. 
	//Вывести на консоль значение последнего элемента.
		
		/*String arr[] = new String [7];
		
		arr [0] = "пн";
		arr [1] = "вт";
		arr [2] = "ср";
		arr [3] = "чт";
		arr [4] = "птн";
		arr [5] = "сб";
		arr [6] = "вс";
		
		System.out.println(arr [6]);*/
		
		/*1. Создать массив типа double с размером 4.
		 Записать в него любые значения с помощью блока для инициализации. 
		 Вывести на консоль значение первого элемента.*/
		
		/*Double [] arr = {0.1,0.2,0.3,0.4};
		System.out.println(arr [0]);*/
		
		/*2. Создать массив типа String размером 3х6. И записать в него значения:
			a1  a2  a3  a4  a5  a6
			b1  b2  b3  b4  b5  b6
			c1  c2   c3  c4  c5  c6
			И распечатать.*/
			
		String arr[] = new String ["a1","a2","a3","a4","a5","a6"]["b1","b2","b3","b4","b5","b6"][c1,c2,c3,c4  c5  c6];
		
		
	}
}
