package by.academy.lesson4;

import java.util.Scanner;

public class TasksL4 {
	public static void main (String [] args) {
		
		//1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
		int y = 1; 
		int a = 1;
		int x = 10;
		
		
		x =y ^ a;
		while (x>=10 && x<20) {
			a++;
			y++;
			System.out.println (a);	
		}
			
		/*2. Составьте программу, которая вычисляет сумму чисел от 1 до n. 
		Значение n вводится с клавиатуры*/
		
		
		/*Scanner sc=new Scanner(System.in);
		System.out.println("������� ����� n: ");
		int n = sc.nextInt();
		sc.close();
		

		while (i<=n) {
			
		}*/
		
	}
}
