package test_final;

//2) Авиакомпания. 
//+Определить иерархию самолетов. 
//Создать авиакомпанию.
//Посчитать общую вместимость и грузоподъемность. 
//Провести сортировку самолетов компании по дальности полета. 
//Найти самолет в компании, соответствующий заданному диапазону параметров потребления горючего.

//Использовать возможности ООП: классы, наследование, полиморфизм, инкапсуляция.
//Каждый класс должен иметь исчерпывающее смысл название и информативный состав.
//Наследование должно применяться только тогда, когда это имеет смысл.
//При кодировании должны быть использованы соглашения об оформлении кода java code convention.
//Классы должны быть грамотно разложены по пакетам.
//Работа с консолью или консольное меню должно быть минимальным.
//Для хранения параметров инициализации можно использовать файлы.



public class FT_Task2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}
	//вводит самолет, авт расчч методы
	//вводит диапазон, подставить в x>=2(i), x<=15(q) 
	//бежит по всем самолетом и находит 
	
	//метод нахождения самолета с последн лекц про машины
	
	

}
