package by.academy.lesson5;

import java.util.Scanner;

public class StrTask {
	public static void main(String[] args) {
		
		/*1. Ввести n строк с консоли, найти самую короткую и самую длинную строки. 
		Вывести найденные строки и их длину.*/
		
		Scanner sc=new Scanner(System.in);
		System.out.println("Введите число строк");
	
		int n = sc.nextInt();
		String smin = sc.next();
		
		for(int i=1;i<n;i++) {
			String s2 = sc.next();
			
		}
		
		scan.close();
				
		//array = scan.nextLine();
		//scan.close();
		
		//число через int n сканер, число = размер массива, через for через перебор, вторая переменная массив, каждую ячейку заполняем через сканер, потом сравнить строки 
		
	}

}
