package by.academy.homework3;

public interface Menu {
	
	//void AddProductToStore();
	
	//void AddProductToBasket();
	//void categoryUser();
	//int answerUser = 0;//0 - нет, 1 - да
//	void answerUser(); //ответ пользователя 
	
	
	
	
	
	
//	нажмите 1 - для начала, 0 - для выхода
//	(если 0 - завершить) 
//	?1-выбрать категорию товара, 0 - выйти
//	выбрать товар для добавления в корзину (сделка)
//	молоко, нажмите - 1
//	хлеб, нажмите - 2
//	сыр, нажмите - 3
//	введите количество штук (название)
//	?положить (количес)(название) в корзину?1-да, 0-нет
//	хотите еще купить товары? 1-да, 0-нет
//	? открыть корзину
//	? подтвердить корзину (количество, товар, сумма корзины)
//	оплатить 
//	сравнить количество денег покуп с итогом
//	больше/равно - печать чека
//	меньше - недостаточно средств для оплаты
//	
//	печать чека 
//	текущая дата
//	название товара, количкство, сумма
//	итог
//	чек через таблицу
			
	
	
	
	
	

}
